# frozen_string_literal: true

MAIN_MENU = %(
  1. Создать объект
  2. Действия с объектами
  3. Информационное меню
  4. Выход)

CREATE_MENU = %(
  1. Создать поезд
  2. Создать маршрут
  3. Создать станцию)

PERFORM_MENU = %(
  1. Поставить поезд на маршрут
  2. Прицепить вагон
  3. Отцепить вагон
  4. Отправить поезд на следующею станцию
  5. Отправить поезд на предыдущею станцию)

INFORMATION_MENU = %(
  1. Информация о поездах
  2. Информация о маршрутах
  3. Информация о станциях)

TRAIN_MENU = %(
  1. Управление поездами
  2. Управление маршрутами
  3. Управление вагонами)

ROUTE_MENU = %(
  1. Довавить станцию в маршрут
  2. Удалить станцию из маршрута)
